W8D1/RedditClone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "mod_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "he"], ["description", "heke"], ["mod_id", 5], ["created_at", "2020-03-30 23:38:04.048850"], ["updated_at", "2020-03-30 23:38:04.048850"]]
---
    def create
        @sub = current_user.subs.new(sub_params)
        @sub.mod_id = current_user.id

        if @sub.save