W6D4/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 8]]
SELECT "artworks".* FROM "artworks" WHERE "artworks"."viewer_id" IS NULL
---
    def index
        debugger
       artworks = Artwork.where(artist_id: params[:user_id])
       artworks += Artwork.where(viewer_id: params[:user_id])

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "CoronaVirus"], ["image_url", "www.italyburns.org"], ["artist_id", 5], ["created_at", "2020-03-20 20:52:55.171368"], ["updated_at", "2020-03-20 20:52:55.171368"]]
---
    def create
        artwork = Artwork.new(artwork_params)
        if artwork.save!

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "updated_at" = $3 WHERE "artworks"."id" = $4  [["title", "Down on the farmmmmm"], ["image_url", "www.iliketofarm.com"], ["updated_at", "2020-03-20 21:03:01.237473"], ["id", 2]]
---
    def update
        artwork = Artwork.find_by(id: params[:id])

        if artwork
            artwork.update(artwork_update_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 4]]
---
    def destroy

        artwork = Artwork.find_by(id: params[:id])

        if artwork
            artwork.destroy