W6D4/app/controllers/artwork_shares_controller.rb

    def create
        share = ArtworkShare.new(share_params)
        if share.save!
---
INSERT INTO "artwork_shares" ("created_at", "updated_at", "artwork_id", "viewer_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2020-03-20 22:08:18.955662"], ["updated_at", "2020-03-20 22:08:18.955662"], ["artwork_id", 2], ["viewer_id", 6]]

    def destroy
        share = ArtworkShare.find_by(id: params[:id])
        if share
            share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 4]]