W6D4/app/controllers/users_controller.rb

    def create
        user = User.new(user_params)
        if user.save!
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Bill"], ["email", "bill@aa.io"], ["created_at", "2020-03-19 23:23:29.322680"], ["updated_at", "2020-03-19 23:23:29.322680"]]

    def update
        user = User.find_by(id: params[:id])

        if user && user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Brittanay"], ["email", "bill@aa.io"], ["updated_at", "2020-03-20 00:00:32.984394"], ["id", 2]]

    def destroy

        user = User.find_by(id: params[:id])
        user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]