W8D1/RedditClone/app/views/users/index.html.erb

SELECT "users".* FROM "users"
---
<ul>
    <% User.all.each do |user| %>