W7D4/goal_app/goal_app/app/controllers/users_controller.rb

    def create
        # Post from the form on :new, to save info to db
        @user = User.new(user_params)
        if @user.save!
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)