W8D1/RedditClone/app/views/subs/show.html.erb

<a href = "<%=new_post_url%>"> Make New Post! </a>
<% @sub.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 1]]