W8D1/RedditClone/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "gxHBa4zVB/NKn07a22H5NEs8XLytZIicvmQLLUbiBF64gmO8uHgWASsJgukdoswucYemoZuf72pwPtyzuYakWw=="], ["updated_at", "2020-03-30 18:19:29.263763"], ["id", 2]]
---
    def reset_session_token!
        self.session_token = SecureRandom.base64(64)
        self.save!