W6D3/first_routes_and_controllers/app/controllers/users_controller.rb

    def create
        user = User.new(user_params)
        if user.save!
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Bill"], ["email", "bill@aa.io"], ["created_at", "2020-03-19 23:23:29.322680"], ["updated_at", "2020-03-19 23:23:29.322680"]]